{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"displayName": "Edición de configuración",
			"description": "Fornece características (IntelliSense avanzado, corrección automática) en ficheiros de configuración, como ficheiros de valores, de inicio e consellos sobre extensións. "
		},
		"dist/extensionsProposals": {
			"exampleExtension": "Exemplo"
		},
		"dist/configurationEditingMain": {
			"workspaceFolder": "A ruta do cartafol aberto no VS Code",
			"workspaceFolderBasename": "O nome da carperta aberta no VS Code sen barra diagonal algunha (/)",
			"relativeFile": "O ficheiro aberto actualmente relativo a ${workspaceFolder}",
			"relativeFileDirname": "Nome do cartafol do ficheiro aberto actual en relación con ${workspaceFolder}",
			"file": "O ficheiro aberto actualmente",
			"cwd": "O cartafol de traballo do executor de tarefas no arranque",
			"lineNumber": "O número de liña seleccionado no ficheiro activo",
			"selectedText": "O texto actual seleccionado no ficheiro activo ",
			"fileDirname": "Nome do cartafol do ficheiro aberto actual",
			"fileExtname": "Extensión do ficheiro aberto actualmente",
			"fileBasename": "Nome base do ficheiro aberto actual ",
			"fileBasenameNoExtension": "Nome base do ficheiro aberto actual sen a extensión ",
			"defaultBuildTask": "O nome da tarefa de compilación predefinida. Se non hai unha única tarefa, amósase unha selección rápida parar escoller a tarefa de compilación."
		},
		"dist/settingsDocumentHelper": {
			"activeEditor": "Empregue o idioma do editor de texto actualmente activo, se existe",
			"activeEditorShort": "o nome do ficheiro (por exemplo miarchivo.txt)",
			"activeEditorMedium": "a ruta do ficheiro relativa ao cartafol do espazo de traballo (p. ex. myFolder/myFileFolder/myFile.txt)",
			"activeEditorLong": "a ruta completa do ficheiro (por exemplo, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"activeFolderShort": "o nome do cartafol no que se atopa o ficheiro (por exemplo, myFileFolder)",
			"activeFolderMedium": "a ruta do cartafol que contén o ficheiro, relativa ao cartafol do espazo de traballo (por ejemplo myFolder/myFileFolder)",
			"activeFolderLong": "a ruta completa do cartafol que contén o ficheiro (por exemplo, /Users/Development/myFolder/myFileFolder)",
			"rootName": "nome do espazo de traballo (p. ex. myFolder ou myWorkspace)",
			"rootPath": "ruta do ficheiro do espazo de traballo (p. ex. /Users/Development/myWorkspace)",
			"folderName": "nome do cartafol do espazo de traballo no que está contido o ficheiro (p. ex. myFolder)",
			"folderPath": "ruta de acceso do ficheiro do cartafol do espazo de traballo no que o ficheiro está contido (p. ex. /Users/Development/myFolder)",
			"appName": "p. ex. VS Code",
			"remoteName": "por exemplo, SSH",
			"dirty": "un indicador con modificacións se o editor activo ten modificacións",
			"separator": "un separador condicional (\"-\") que aparece só cando está rodeado de variables con valores",
			"assocLabelFile": "Ficheiros con extensión",
			"assocDescriptionFile": "Asigna todos os ficheiros nos que o nome coincide co patrón global á linguaxe co identificador especificado.",
			"assocLabelPath": "Ficheiros con ruta de acceso",
			"assocDescriptionPath": "Asignar todos os ficheiros nos que a ruta de acceso á linguaxe co identificador especificado coincide co patrón global de ruta de acceso absoluta.",
			"fileLabel": "Ficheiros por extensión",
			"fileDescription": "Facer coincidir todos os ficheiros que teñan unha extensión determinada.",
			"filesLabel": "Ficheiros con varias extensións",
			"filesDescription": "Facer coincidir todos os ficheiros con calquera das extensións.",
			"derivedLabel": "Ficheiros con elementos do mesmo nivel por nome",
			"derivedDescription": "Facer coincidir ficheiros que teñen elementos do mesmo nivel co mesmo nome pero con extensión diferente.",
			"topFolderLabel": "Cartafol por nome (nivel superior)",
			"topFolderDescription": "Facer coincidir un cartafol de nivel superior cun nome específico.",
			"topFoldersLabel": "Cartafoles con varios nomes (nivel superior)",
			"topFoldersDescription": "Facer coincidir varios cartafoles de nivel superior.",
			"folderLabel": "Cartafol por nome (calquera localización)",
			"folderDescription": "Facer coincidir un cartafol cun nome determinado en calquera localización.",
			"falseDescription": "Deshabilitar o patrón.",
			"trueDescription": "Habilitar o patrón.",
			"siblingsDescription": "Facer coincidir os ficheiros que teñen elementos do mesmo nivel co mesmo nome pero con extensión diferente.",
			"languageSpecificEditorSettings": "Configuración do editor específica da linguaxe",
			"languageSpecificEditorSettingsDescription": "Substituír configuración do editor para linguaxe"
		}
	}
}