{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"displayName": "Características da linguaxe JSON",
			"description": "Fornece dun potente soporte da linguaxe para ficheiros JSON.",
			"json.schemas.desc": "Asociar esquemas a ficheiros JSON no proxecto actual",
			"json.schemas.url.desc": "Un URL a un esquema ou ruta relativa a un esquema no directorio actual",
			"json.schemas.fileMatch.desc": "Una matriz de patróns de ficheiros para facer a correspondencia ao resolver os ficheiros JSON a esquemas. Pode empregar \"*\" como carácter de substitución. Tamén é posíbel empregar caracteres de exclusión e comezar con \"!\". Un ficheiro coincide cando hai polo menos un patrón de coincidencia e o último patrón non é un patrón de exclusión.",
			"json.schemas.fileMatch.item.desc": "Un patrón de ficheiros que pode conter \"*\" para facer a correspondencia ao resolver os ficheiros JSON a esquemas.",
			"json.schemas.schema.desc": "A definición do esquema para o URL fornecido. Só é preciso definilo para evitar accesos ao URL do esquema.",
			"json.format.enable.desc": "Activar ou desactivar o formatador JSON predefinido",
			"json.tracing.desc": "Fai o seguimento da comunicación entre VS Code e o servidor de linguaxe JSON.",
			"json.colorDecorators.enable.desc": "Activar ou desactivar os decoradores de cor",
			"json.colorDecorators.enable.deprecationMessage": "O valor \"json.colorDecorators.enable\" está obsoleto, empregar \"editor.colorDecorators\".",
			"json.schemaResolutionErrorMessage": "Non é posíbel resolver o esquema.",
			"json.clickToRetry": "Facer clic para tentar de novo.",
			"json.maxItemsComputed.desc": "O número máximo computado de símbolos do esquema e rexións de pregado (limitado por motivos de rendemento).",
			"json.enableSchemaDownload.desc": "Cando está activado, pódense capturar os esquemas JSON dende localizacións http y https."
		},
		"client\\dist\\node/jsonClient": {
			"json.resolveError": "JSON: Erro de resolución de esquemas",
			"jsonserver.name": "Servidor de linguaxe JSON",
			"untitled.schema": "Non é posíbel cargar {0}",
			"schemaDownloadDisabled": "A descarga de esquemas está desactivada mediante o valor \"{0}\"",
			"configureLimit": "Usar o valor \"{0}\" para definir o límite.",
			"json.schemaResolutionErrorMessage": "Non é posíbel resolver o esquema. Facer clic para tentar de novo.",
			"json.schemaResolutionDisabledMessage": "A descarga de esquemas está desactivada. Facer clic para definir."
		}
	}
}